[
  {
    "name": "Alter",
    "slug": "alter",
    "real_name": "YingLing Lui",
    "age": null,
    "homeworld": null,
    "class": "Skirmisher",
    "voice_actor": "Crystal Yu",
    "appearance_season": "Season 21",
    "title": "Void Breacher",
    "abilities": {
      "tactical": {
        "name": "Void Passage",
        "description": "Create a portal on either side of any surface under 45m away, lasting 15 s."
      },
      "passive": {
        "name": "Gift from the Rift",
        "description": "See and remotely take one non-armor item from death boxes through walls."
      },
      "ultimate": {
        "name": "Void Nexus",
        "description": "Deploy a device that your squad can teleport back to via a one‑way portal."
      }
    },
    "backstory": "When Alter emerged from her dimension into another (with her past held close to the chest), she had only two things: her interdimensional traveling Void tech, and a desire to have fun. She stole the fanciest of foods, learned to fight through dicey situations, and took on odd jobs for personal favors–though she didn't have a problem double-crossing her clients if it was more beneficial or amusing. Never needing to stick around for the consequences of her actions eroded any sense of morality or responsibility she had. She could focus on what was important: making sure life was never mundane.\n\nAlter was drawn to worlds on the edge of complete destruction. Whether something devastating was already happening or she helped usher in the apocalypse herself, she was there to watch whatever catastrophe ensued. It was only in those moments, after all, that people took off the masks they always wore and she could see their true selves.\n\nFinding these world-ending events was a toss up. Sometimes she'd find what she was looking for, and on others, she'd have missed the main event in worlds already ruined. But in some of these ruined worlds, Alter began to notice an interesting commonality…\n\nMany of these worlds hadn't met their end by some random event; they had been destroyed by the same person.",
    "image": "/images/legend-portraits/alter.webp"
  },

  {
    "name": "Ash",
    "slug": "ash",
    "real_name": "Dr. Ashleigh Reid",
    "age": "121",
    "homeworld": "Unknown",
    "class": "Assault",
    "voice_actor": "Anna Campbell",
    "appearance_season": "Season 11",
    "title": "Incisive Instigator",
    "abilities": {
      "tactical": {
        "name": "Arc Snare",
        "description": "Throw a spinning snare that damages and tethers the first enemy that gets too close."
      },
      "passive": {
        "name": "Marked for Death",
        "description": "Ash's map shows the location of recent deathboxes. Press on a deathbox to mark surviving attackers."
      },
      "ultimate": {
        "name": "Phase Breach",
        "description": "Tear open a one-way portal to a targeted location."
      }
    },
    "backstory": "Dr. Ashleigh Reid was a brilliant scientist working with Horizon on gravitational research. Her ambition and betrayal led to her transformation into the simulacrum assassin known as Ash. After regaining fragments of her past, Ash entered the Apex Games to assert control over her dual identities and prove her dominance.",
    "image": "/images/legend-portraits/ash.webp"
  },
  {
    "name": "Ballistic",
    "slug": "ballistic",
    "real_name": "August Montgomery Brinkman",
    "age": "63",
    "homeworld": "Gaea",
    "class": "Assault",
    "voice_actor": "Robin Atkin Downes",
    "appearance_season": "Season 17",
    "title": "Refined Gunslinger",
    "abilities": {
      "tactical": {
        "name": "Whistler",
        "description": "Shoots a projectile that heats up an enemy's gun as they shoot, eventually overheating and damaging the user."
      },
      "passive": {
        "name": "Sling",
        "description": "Store a third weapon in the sling. Access it via inventory or Character Utility Action. The sling weapon cannot take attachments."
      },
      "ultimate": {
        "name": "Tempest",
        "description": "Grants faster reloads, faster armed move speed, and unlimited ammo to Ballistic and nearby teammates. The sling weapon is equipped and upgraded to gold."
      }
    },
    "backstory": "Born into a wealthy family on Gaea, August Brinkman lived a privileged but rebellious life, drawn to the thrill of combat sports. He joined the Thunderdome Games in his youth, becoming a famous and reckless competitor. After retiring due to the death of his brother-in-law, he came out of retirement to protect his son from joining the Games, joining the Apex Games himself in a last attempt to keep his family safe.",
    "image": "/images/legend-portraits/ballistic.webp"
  },
  {
    "name": "Bangalore",
    "slug": "bangalore",
    "real_name": "Anita Williams",
    "age": "38",
    "homeworld": "Gridiron",
    "class": "Assault",
    "voice_actor": "Erica Luttrell",
    "appearance_season": "Preseason",
    "title": "Professional Soldier",
    "abilities": {
      "tactical": {
        "name": "Smoke Launcher",
        "description": "Fire a high-velocity smoke canister that explodes into a smoke wall on impact."
      },
      "passive": {
        "name": "Double Time",
        "description": "Taking fire while sprinting makes you move faster for a brief time."
      },
      "ultimate": {
        "name": "Rolling Thunder",
        "description": "Call in an artillery strike that slowly creeps across the landscape."
      }
    },
    "backstory": "Raised in a military family on Gridiron, Anita was one of five siblings trained for combat from a young age. She excelled in the IMC as a top-tier soldier and weapons expert, but went missing after a mission went wrong and her brother disappeared. She entered the Apex Games to earn enough money to return home and find her lost brother.",
    "image": "/images/legend-portraits/bangalore.webp"
  },
  {
    "name": "Bloodhound",
    "slug": "bloodhound",
    "real_name": "Blódhundr",
    "age": "Unknown",
    "homeworld": "Talos",
    "class": "Recon",
    "voice_actor": "Allegra Clark",
    "appearance_season": "Season 0",
    "title": "Technological Tracker",
    "abilities": {
      "tactical": {
        "name": "Eye of the Allfather",
        "description": "Briefly reveal hidden enemies, traps, and clues through all structures in front of you."
      },
      "passive": {
        "name": "Tracker",
        "description": "See tracks left behind by your foes."
      },
      "ultimate": {
        "name": "Beast of the Hunt",
        "description": "Enhance your senses, allowing you to move faster and highlight your prey."
      }
    },
    "backstory": "Raised on the harsh, volcanic planet of Talos by their uncle after being orphaned by a meltdown, Bloodhound was taught both ancient traditions and modern technologies. They became a skilled hunter revered in their village, combining old ways with new tools and earning a legendary reputation. Bloodhound joined the Apex Games seeking glory and to prove the value of nature, balance, and the Old Norse gods in an increasingly fractured world.",
    "image": "/images/legend-portraits/bloodhound.webp"
  },
  {
    "name": "Catalyst",
    "slug": "catalyst",
    "real_name": "Tressa Crystal Smith",
    "age": "29",
    "homeworld": "Boreas",
    "class": "Controller",
    "voice_actor": "Meli Grant",
    "appearance_season": "Season 15",
    "title": "Defensive Conjurer",
    "abilities": {
      "tactical": {
        "name": "Piercing Spikes",
        "description": "Throw out a patch of ferrofluid which turns into spikes when enemies are near."
      },
      "passive": {
        "name": "Barricade",
        "description": "Reinforce doors, strengthening them and locking them to enemies."
      },
      "ultimate": {
        "name": "Dark Veil",
        "description": "Raise a permeable wall of ferrofluid that slows and blinds enemies who walk through it."
      }
    },
    "backstory": "Tressa grew up on the moon Boreas, where she faced discrimination as a transgender woman. She found comfort in working with ferrofluid and arcane sciences. She worked as a terraformer to help stabilize the collapsing moon, and was part of a resistance movement against corporate exploitation. She joined the Games to draw attention to Boreas's plight and to take control of her own destiny.",
    "image": "/images/legend-portraits/catalyst.webp"
  },
  {
    "name": "Caustic",
    "slug": "caustic",
    "real_name": "Alexander Nox",
    "age": "49",
    "homeworld": "Gaea",
    "class": "Controller",
    "voice_actor": "JB Blanc",
    "appearance_season": "Preseason",
    "title": "Toxic Trapper",
    "abilities": {
      "tactical": {
        "name": "Nox Gas Trap",
        "description": "Place up to six canisters that release deadly Nox gas when shot or triggered by enemies."
      },
      "passive": {
        "name": "Nox Vision",
        "description": "Allows you to see enemies through your gas."
      },
      "ultimate": {
        "name": "Nox Gas Grenade",
        "description": "Blanket a large area in Nox gas."
      }
    },
    "backstory": "Alexander Nox was a brilliant scientist working for Humbert Labs, developing pesticides. His obsession with testing on living subjects led him to darker experiments. He worked as a chemical engineer and faked his own death in a lab fire to escape persecution for unethical experimentation. He joined the Games to continue his research on human exposure to toxic substances in live combat.",
    "image": "/images/legend-portraits/caustic.webp"
  },
  {
    "name": "Conduit",
    "slug": "conduit",
    "real_name": "Rowenna Valentina Coffey",
    "age": "27",
    "homeworld": "Samoa (Planet Solace)",
    "class": "Support",
    "voice_actor": "Frankie Kevich",
    "appearance_season": "Season 19",
    "title": "The Shield of Solace",
    "abilities": {
      "tactical": {
        "name": "Radiant Transfer",
        "description": "Send a surge of shields to a teammate, at the cost of your own."
      },
      "passive": {
        "name": "Savior's Speed",
        "description": "Gain a burst of speed when running toward a teammate out of tactical range."
      },
      "ultimate": {
        "name": "Energy Barricade",
        "description": "Deploy an array of shield jammers that damage and slow enemies."
      }
    },
    "backstory": "Grew up in a war-torn Solace, where she witnessed firsthand the devastation of the Frontier Wars. She worked odd jobs to support her family, eventually volunteering for experimental IMC tech to gain powers. She joined the Apex Games to provide for her family and redeem her sister's failed dream of heroism.",
    "image": "/images/legend-portraits/conduit.webp"
  },
  {
    "name": "Crypto",
    "slug": "crypto",
    "real_name": "Tae Joon Park",
    "age": "31",
    "homeworld": "Gaea",
    "class": "Recon",
    "voice_actor": "Johnny Young",
    "appearance_season": "Season 3",
    "title": "Surveillance Expert",
    "abilities": {
      "tactical": {
        "name": "Surveillance Drone",
        "description": "Deploy an aerial drone to survey the area and mark enemies."
      },
      "passive": {
        "name": "Neurolink",
        "description": "Enemies detected by the drone within 30 meters are marked for you and your teammates."
      },
      "ultimate": {
        "name": "Drone EMP",
        "description": "Charge up and unleash an EMP blast from your drone, dealing shield damage and disabling traps."
      }
    },
    "backstory": "Orphaned young, Tae Joon Park was raised in the streets before being adopted. He excelled in tech and hacking, eventually working for the Syndicate as a computer engineer before being framed and going on the run. He entered the Games under the alias Crypto to uncover who set him up and to search for Mila.",
    "image": "/images/legend-portraits/crypto.webp"
  },
  {
    "name": "Fuse",
    "slug": "fuse",
    "real_name": "Walter Fitzroy",
    "age": "55",
    "homeworld": "Salvo",
    "class": "Assault",
    "voice_actor": "Ben Prendergast",
    "appearance_season": "Season 8",
    "title": "Explosives Enthusiast",
    "abilities": {
      "tactical": {
        "name": "Knuckle Cluster",
        "description": "Launch a cluster bomb that continuously expels airburst explosives on impact."
      },
      "passive": {
        "name": "Grenadier",
        "description": "Stack an extra grenade per inventory slot. Fire grenades farther, faster, and more accurately."
      },
      "ultimate": {
        "name": "The Motherlode",
        "description": "Launch a bombardment that encircles a target area in a wall of flame."
      }
    },
    "backstory": "Grew up on Salvo in a rough-and-tumble environment where survival often meant blowing something up. A cage fighter and mercenary, Fuse rose to fame as Salvo's champion before joining the Apex Games. He left Salvo (and Maggie) to join the Games, seeking a bigger stage for his explosive personality.",
    "image": "/images/legend-portraits/fuse.webp"
  },
  {
    "name": "Gibraltar",
    "slug": "gibraltar",
    "real_name": "Makoa Gibraltar",
    "age": "32",
    "homeworld": "Solace",
    "class": "Support",
    "voice_actor": "Branscombe Richmond",
    "appearance_season": "Preseason",
    "title": "Shielded Fortress",
    "abilities": {
      "tactical": {
        "name": "Dome of Protection",
        "description": "Throw down a dome shield that blocks attacks for 12 seconds."
      },
      "passive": {
        "name": "Gun Shield",
        "description": "Aiming down sights deploys a gun shield that blocks incoming fire."
      },
      "ultimate": {
        "name": "Defensive Bombardment",
        "description": "Call in a concentrated mortar strike on a marked position."
      }
    },
    "backstory": "Always a gentle giant, Makoa learned the importance of helping others after a near-death experience with his boyfriend. He worked in search and rescue alongside his father before becoming a legend. He joined the Games not for fame, but to protect the people of the Outlands in his own way.",
    "image": "/images/legend-portraits/gibraltar.webp"
  },
  {
    "name": "Horizon",
    "slug": "horizon",
    "real_name": "Dr. Mary Somers",
    "age": "37",
    "homeworld": "Psamathe",
    "class": "Skirmisher",
    "voice_actor": "Elle Newlands",
    "appearance_season": "Season 7",
    "title": "Gravitational Manipulator",
    "abilities": {
      "tactical": {
        "name": "Gravity Lift",
        "description": "Reverses the flow of gravity, lifting players upward and boosting them outward when they exit."
      },
      "passive": {
        "name": "Spacewalk",
        "description": "Increased air control and reduced fall impacts with Horizon's custom spacesuit."
      },
      "ultimate": {
        "name": "Black Hole",
        "description": "Deploy NEWT to create a micro black hole that pulls players in and damages them with a gravitational blast."
      }
    },
    "backstory": "A brilliant astrophysicist from Psamathe who specialized in black hole research, Dr. Mary Somers conducted experiments on gravitational anomalies and developed AI tech with her son Newton. She joined the Apex Games to fund her research and reconnect with Newton, having returned decades after her disappearance due to time dilation.",
    "image": "/images/legend-portraits/horizon.webp"
  },
  {
    "name": "Lifeline",
    "slug": "lifeline",
    "real_name": "Ajay Che",
    "age": "26",
    "homeworld": "Psamathe",
    "class": "Support",
    "voice_actor": "Mela Lee",
    "appearance_season": "Preseason",
    "title": "Combat Medic",
    "abilities": {
      "tactical": {
        "name": "D.O.C. Heal Drone",
        "description": "Deploys a drone that automatically heals nearby teammates over time."
      },
      "passive": {
        "name": "Combat Revive",
        "description": "Deploy D.O.C. to revive teammates, freeing Lifeline to defend or assist others."
      },
      "ultimate": {
        "name": "Care Package",
        "description": "Call in a drop pod full of high-quality defensive gear."
      }
    },
    "backstory": "Born into the wealthy Che family of war profiteers, Ajay rejected their values and joined the Frontier Corps. She worked as a combat medic providing humanitarian aid in war zones. She entered the Apex Games to fund medical supplies and humanitarian efforts for the Frontier Corps.",
    "image": "/images/legend-portraits/lifeline.webp"
  },
  {
    "name": "Loba",
    "slug": "loba",
    "real_name": "Loba Andrade",
    "age": "34",
    "homeworld": "None (born in Solace, raised across the Outlands)",
    "class": "Support",
    "voice_actor": "Fryda Wolff",
    "appearance_season": "Season 5",
    "title": "Translocating Thief",
    "abilities": {
      "tactical": {
        "name": "Burglar's Best Friend",
        "description": "Teleport to hard-to-reach places or escape trouble quickly by throwing your jump drive bracelet."
      },
      "passive": {
        "name": "Eye for Quality",
        "description": "Nearby epic and legendary loot can be seen through walls."
      },
      "ultimate": {
        "name": "Black Market Boutique",
        "description": "Place a portable device that allows you to teleport nearby loot to your inventory."
      }
    },
    "backstory": "Witnessed her father's death at the hands of Revenant and grew up in the criminal underworld. She became one of the most accomplished thieves in the Outlands, using her skills to survive. She joined the Apex Games to gain access to powerful technology and seek revenge on Revenant.",
    "image": "/images/legend-portraits/loba.webp"
  },
  {
    "name": "Mad Maggie",
    "slug": "mad-maggie",
    "real_name": "Margaret Kōhere",
    "age": "55",
    "homeworld": "Salvo",
    "class": "Assault",
    "voice_actor": "Nicola Kāwana",
    "appearance_season": "Season 12",
    "title": "Rebel Warlord",
    "abilities": {
      "tactical": {
        "name": "Riot Drill",
        "description": "Fire a drill that burns enemies through obstacles."
      },
      "passive": {
        "name": "Warlord's Ire",
        "description": "Highlight enemies you've damaged and move faster with shotguns."
      },
      "ultimate": {
        "name": "Wrecking Ball",
        "description": "Throw a ball that releases speed-boosting pads and detonates near enemies."
      }
    },
    "backstory": "Grew up impoverished on Salvo and became a freedom fighter against the Syndicate. She led guerrilla campaigns and uprisings on Salvo, earning her a reputation as a ruthless rebel. She was sentenced to death but survived and was forced into the Apex Games as a political pawn.",
    "image": "/images/legend-portraits/mad-maggie.webp"
  },
  {
    "name": "Mirage",
    "slug": "mirage",
    "real_name": "Elliott Rodger Witt",
    "age": "32",
    "homeworld": "Solace",
    "class": "Support",
    "voice_actor": "Roger Craig Smith",
    "appearance_season": "Preseason",
    "title": "Holographic Trickster",
    "abilities": {
      "tactical": {
        "name": "Psyche Out",
        "description": "Send out a holographic decoy to confuse the enemy."
      },
      "passive": {
        "name": "Now You See Me...",
        "description": "Automatically cloak when using Respawn Beacons and reviving teammates."
      },
      "ultimate": {
        "name": "Life of the Party",
        "description": "Deploy a team of decoys to distract enemies."
      }
    },
    "backstory": "Elliott grew up as the youngest of four brothers. He developed a close relationship with his mother after his father left and his brothers went missing during the Outlands Civil War. He worked as a bartender and night shift manager, owning the Paradise Lounge. Encouraged by his mother, he joined the Apex Games to showcase his holographic talents and support them both financially.",
    "image": "/images/legend-portraits/mirage.webp"
  },
  {
    "name": "Newcastle",
    "slug": "newcastle",
    "real_name": "Lamont Craig",
    "age": "40",
    "homeworld": "Harris Valley, Solace",
    "class": "Support",
    "voice_actor": "Gabe Kunda",
    "appearance_season": "Season 13",
    "title": "Hero of Harris Valley",
    "abilities": {
      "tactical": {
        "name": "Mobile Shield",
        "description": "Throw a controllable drone that creates a moving energy shield."
      },
      "passive": {
        "name": "Retrieve the Wounded",
        "description": "Drag downed allies as you revive and protect them with your Revive Shield."
      },
      "ultimate": {
        "name": "Castle Wall",
        "description": "Leap to an ally or target area and slam down a shielded fortress wall."
      }
    },
    "backstory": "Grew up in Harris Valley alongside his sister Anita, training to protect his community. He assumed the identity of Newcastle to keep his town safe and repay debts. He entered the Apex Games under the guise of Newcastle to protect his town and eventually revealed his identity to Bangalore.",
    "image": "/images/legend-portraits/newcastle.webp"
  },
  {
    "name": "Octane",
    "slug": "octane",
    "real_name": "Octavio Silva",
    "age": "24",
    "homeworld": "Psamathe",
    "class": "Skirmisher",
    "voice_actor": "Nicolas Roye",
    "appearance_season": "Season 1",
    "title": "The Adrenaline Junkie",
    "abilities": {
      "tactical": {
        "name": "Stim",
        "description": "Move 30% faster for 6 seconds. Costs health to use."
      },
      "passive": {
        "name": "Swift Mend",
        "description": "Automatically restores health over time."
      },
      "ultimate": {
        "name": "Launch Pad",
        "description": "Deploy a jump pad that catapults anyone who steps on it into the air."
      }
    },
    "backstory": "Born into wealth and privilege, Octavio sought thrills from a young age. He lost his legs during a stunt using a grenade to boost a race time and persuaded Ajay (Lifeline) to forge bionic replacements. He joined the Games for the ultimate thrill-seeking opportunity.",
    "image": "/images/legend-portraits/octane.webp"
  },
  {
    "name": "Pathfinder",
    "slug": "pathfinder",
    "real_name": "MRVN (Mobile Robotic Versatile eNtity)",
    "age": "75 (since activation)",
    "homeworld": "Unknown",
    "class": "Skirmisher",
    "voice_actor": "Chris Edgerly",
    "appearance_season": "Preseason",
    "title": "Forward Scout",
    "abilities": {
      "tactical": {
        "name": "Grappling Hook",
        "description": "Grapple to get to out-of-reach places quickly."
      },
      "passive": {
        "name": "Insider Knowledge",
        "description": "Scan a survey beacon to reduce your Ultimate cooldown."
      },
      "ultimate": {
        "name": "Zipline Gun",
        "description": "Create a zipline for everyone to use."
      }
    },
    "backstory": "Activated decades ago in a now-abandoned laboratory with no memory of his purpose, Pathfinder wandered the Outlands trying to learn who created him and why. He entered the Games hoping to attract the attention of his creator.",
    "image": "/images/legend-portraits/pathfinder.webp"
  },
  {
    "name": "Rampart",
    "slug": "rampart",
    "real_name": "Ramya Parekh",
    "age": "21",
    "homeworld": "Gaea",
    "class": "Support",
    "voice_actor": "Anjali Bhimani",
    "appearance_season": "Season 6",
    "title": "Base of Fire",
    "abilities": {
      "tactical": {
        "name": "Amped Cover",
        "description": "Build a crouch-cover wall that blocks incoming shots and amps outgoing shots."
      },
      "passive": {
        "name": "Modded Loader",
        "description": "Increased magazine size and faster reloads with LMGs and the Minigun."
      },
      "ultimate": {
        "name": "Mobile Minigun 'Sheila'",
        "description": "Deploy a mounted machine gun that anyone can use. Can also carry and fire it while mobile."
      }
    },
    "backstory": "Grew up in the underbelly of Gaea, fixing weapons and tech from a young age. She ran a modding shop in Gaea's underground until it was destroyed by a gang. She gained notoriety from underground fight mods and joined the Apex Games for fame, fortune, and to rebuild her shop—and her name.",
    "image": "/images/legend-portraits/rampart.webp"
  },
  {
    "name": "Revenant",
    "slug": "revenant",
    "real_name": "Kaleb Cross",
    "age": "313",
    "homeworld": "Solace",
    "class": "Skirmisher",
    "voice_actor": "Darin De Paul",
    "appearance_season": "Season 4",
    "title": "Synthetic Nightmare",
    "abilities": {
      "tactical": {
        "name": "Shadow Pounce",
        "description": "Leap forward with a powerful pounce to close the distance."
      },
      "passive": {
        "name": "Assassin's Instinct",
        "description": "See low-health enemies and move faster while crouching."
      },
      "ultimate": {
        "name": "Forged Shadows",
        "description": "Create shrouds of hardened shadows around you, blocking damage."
      }
    },
    "backstory": "Once a human hitman, Kaleb Cross worked for Hammond Robotics until they turned him into a simulacrum without his consent. He was a top-tier assassin before and after his conversion into a deadly machine. He entered the Games after regaining memory of his human past, now driven by vengeance against his creators.",
    "image": "/images/legend-portraits/revenant.webp"
  },
  {
    "name": "Seer",
    "slug": "seer",
    "real_name": "Obi Edolasim",
    "age": "26",
    "homeworld": "Boreas",
    "class": "Recon",
    "voice_actor": "Iké Amadi",
    "appearance_season": "Season 10",
    "title": "Ambush Artist",
    "abilities": {
      "tactical": {
        "name": "Focus of Attention",
        "description": "Send out micro-drones to reveal and interrupt enemies through walls."
      },
      "passive": {
        "name": "Heart Seeker",
        "description": "Hear and visualize enemy heartbeats when aiming down sights."
      },
      "ultimate": {
        "name": "Exhibit",
        "description": "Create a sphere that reveals enemies' movements within it."
      }
    },
    "backstory": "Born during a celestial anomaly, Obi was marked as cursed but raised with love. He became a celebrated performer and underground sensation using his drones. He entered the Games to reshape his narrative and prove beauty and truth belong on the battlefield.",
    "image": "/images/legend-portraits/seer.webp"
  },
  {
    "name": "Sparrow",
    "slug": "sparrow",
    "real_name": "Enea Davide Guarino",
    "age": "28",
    "homeworld": "Psamathe",
    "class": "Recon",
    "voice_actor": "null",
    "appearance_season": "21",
    "title": "Interdimensional Tracker",
    "abilities": {
      "tactical": {
        "name": "Null Shot",
        "description": "Fires a projectile that disables enemy abilities for a short time."
      },
      "passive": {
        "name": "Echo Sense",
        "description": "Highlights recent enemy movement trails."
      },
      "ultimate": {
        "name": "Phase Collapse",
        "description": "Creates a destabilized zone that pulls enemies and suppresses abilities."
      }
    },
    "backstory": "Enea Davide Guarino is an interdimensional tracker who emerged from the void with mysterious origins. As Sparrow, they use their unique abilities to track and disrupt enemy abilities across dimensions, bringing chaos to the battlefield with their void-based technology.",
    "image": "/images/legend-portraits/sparrow.webp"
  },

  {
    "name": "Valkyrie",
    "slug": "valkyrie",
    "real_name": "Kairi Imahara",
    "age": "31",
    "homeworld": "Angelia",
    "class": "Recon",
    "voice_actor": "Erika Ishii",
    "appearance_season": "Season 9",
    "title": "Winged Avenger",
    "abilities": {
      "tactical": {
        "name": "Missile Swarm",
        "description": "Fire a swarm of mini-rockets that damage and disorient enemies."
      },
      "passive": {
        "name": "VTOL Jets",
        "description": "Use your jetpack to fly. Fuel is limited but refills over time."
      },
      "ultimate": {
        "name": "Skyward Dive",
        "description": "Launch into the air and skydive to a new location. Squadmates can join the launch."
      }
    },
    "backstory": "Kairi Imahara grew up the daughter of notorious Apex Predator pilot Viper. She idolized her father but was left adrift after his death at the hands of Jack Cooper. She took odd jobs as a mechanic and smuggler, eventually rebuilding a modified version of her father's Northstar Titan as a jetpack. She entered the Apex Games seeking revenge, but found new purpose through the competition and the legacy she was building for herself.",
    "image": "/images/legend-portraits/valkyrie.webp"
  },
  {
    "name": "Vantage",
    "slug": "vantage",
    "real_name": "Xiomara 'Mara' Contreras",
    "age": "19",
    "homeworld": "Págos",
    "class": "Recon",
    "voice_actor": "Natalie Canizares",
    "appearance_season": "14",
    "title": "Survivalist Sniper",
    "abilities": {
      "tactical": {
        "name": "Echo Relocation",
        "description": "Position your bat Echo, then launch toward him."
      },
      "passive": {
        "name": "Spotter's Lens",
        "description": "Use your eyepiece to read tactical info on enemies."
      },
      "ultimate": {
        "name": "Sniper's Mark",
        "description": "Mark enemies and apply a damage boost for Vantage and her squad."
      }
    },
    "backstory": "Raised alone by her mother in the icy wastes of Págos, Xiomara 'Mara' Contreras was trained in survivalism and tracking animals. She joined the Apex Games to help clear her mother's name and find the truth about her past.",
    "image": "/images/legend-portraits/vantage.webp"
  },
  {
    "name": "Wattson",
    "slug": "wattson",
    "real_name": "Natalie Paquette",
    "age": "24",
    "homeworld": "Solace",
    "class": "Controller",
    "voice_actor": "Justine Huxley",
    "appearance_season": "2",
    "title": "Static Defender",
    "abilities": {
      "tactical": {
        "name": "Perimeter Security",
        "description": "Connect nodes to create electrified fences that damage and slow enemies."
      },
      "passive": {
        "name": "Spark of Genius",
        "description": "Ultimate Accelerants fully charge your ultimate. Standing near interception pylon recharges tactical faster."
      },
      "ultimate": {
        "name": "Interception Pylon",
        "description": "Place an electrified pylon that destroys incoming ordnance and repairs damaged shields."
      }
    },
    "backstory": "Raised in the Games' arena, close to her father and surrounded by tech, Natalie Paquette helped design the Apex Games' ring systems. She entered the Games after her father's death as a way to honor his legacy and find connection.",
    "image": "/images/legend-portraits/wattson.webp"
  },
  {
    "name": "Wraith",
    "slug": "wraith",
    "real_name": "Renee Hope Blasey",
    "age": "32",
    "homeworld": "Typhon",
    "class": "Skirmisher",
    "voice_actor": "Shantel VanSanten",
    "appearance_season": "Preseason",
    "title": "Interdimensional Skirmisher",
    "abilities": {
      "tactical": {
        "name": "Into the Void",
        "description": "Reposition quickly through the safety of void space, avoiding all damage."
      },
      "passive": {
        "name": "Voices from the Void",
        "description": "A voice warns you when danger approaches. As far as you can tell, it's on your side."
      },
      "ultimate": {
        "name": "Dimensional Rift",
        "description": "Link two locations with portals for 60 seconds, allowing anyone to use them."
      }
    },
    "backstory": "Renee Blasey was a senior science pilot for the IMC before being imprisoned and experimented on by the organization she worked for. She was an IMC scientist working on phase technology, later subjected to it in secret experiments. She escaped captivity with the help of a mysterious alternate version of herself and now fights to uncover her past.",
    "image": "/images/legend-portraits/wraith.webp"
  }
]
