"We'll win this thing together. Semper Fi or die." — Bangalore  
"Many have made the mistake of crossing me. Many more will make it today." — Ash  
"Come on, use your head." — Lifeline  
"You're either ready or you're an idiot." — Crypto  
"Get ready... today's not gon' be easy." — Lifeline  
"You and me, let's take this win." — Lifeline  
"Rest assured I will accept nothing less than perfection." — Ash  
"Placing the portal." — Wraith  
"Ready, set, go!" — Octane  
"Heads up, dropping the pain!" — Bangalore  
"I bathe in the bloth!" — Bloodhound  
"Just a minute until the ring closes, and I'm just getting warmed up." — Loba  
"Death is inevitable. It’s calling you." — Revenant  
"Harder, faster, stronger." — Octane  
"You're not my target — yet." — Seer  
"This is your champion." — Intro VO  
"I am prepared for the fight." — Gibraltar  
"Surprise. I'm back." — Mirage  
"Get ready... today's not gon' be easy." — Lifeline  
"Go on, try to stop me!" — Lifeline  
"You and me, let's take this win." — Lifeline  
"Come on, we've got work to do." — Lifeline  
"We've got a job to do, so shift your carcass." — Lifeline  
"I'm ready. Let's get the job done." — Lifeline  
"This is gonna be a good fight." — Lifeline  
"It's time to impress." — Lifeline  

"Reckless and full of wrecks. Let's go!" — Octane  
"Today's a good day to cheat death." — Octane  
"What are you waiting for? Let's do this!" — Octane  
"It's showtime!" — Octane  
"Scooting and looting, amigo." — Octane  
"Let's go for a ride." — Octane  
"Race you to the LZ." — Octane  
"Pick me, pick me, pick me, I'm so bored!" — Octane  
"I got the need... for speed." — Octane  
"Harder, faster, stronger!" — Octane  

"Time to rock 'n' load." — Fuse  
"Been puttin' the 'bomb' in bombastic since 2681." — Fuse  
"If there's dirty deeds need doin’, I’ll do 'em dirt cheap." — Fuse  
"Switching to Kings Canyon. Here we go, fellas." — Fuse  

"I almost let you die before. Not now." — Loba  
"Even legends need a break." — Loba  
"I'm not just a thief, I'm the best damn thief in the Outlands." — Loba  
"A little bit of loot, a whole lot of style." — Loba  

"I cannot wait to win this match, friend!" — Pathfinder  
"The championship is ours!" — Pathfinder  
"Good luck. Have fun. Don't die!" — Pathfinder  
"Losing isn't fun. That's why I don't do it." — Pathfinder  
"Did you see me out there? Of course you did, I'm the Jumpmaster!" — Pathfinder  

"Many have made the mistake of crossing me. Many more will make it today." — Ash  
"Rest assured I will accept nothing less than perfection." — Ash  
"This is my favorite part." — Ash  

"Come on, use your head." — Lifeline  
"You're either ready or you're an idiot." — Crypto  
"Heads up, dropping the pain!" — Bangalore  
"I bathe in the bloth!" — Bloodhound  
"Surprise. I'm back." — Mirage  
"You're not my target — yet." — Seer  
“Someone wants to challenge us? Ottimo, I've been dying to take the gloves off.” — Sparrow
“Trapping, fighting, facing possible death... Ah, la bella vita.” — Sparrow
“Let's get out there and shoot with reckless abandon. Ah, che bello.” — Sparrow
“What’s a little bloodsport between friends? Andiamo, ragazzi.” — Sparrow
“Mia madre always said, don't lose, passerotto. I don't plan on letting her down.” — Sparrow
“Always look out for the little guy... I'm not talking about me, I'm just petite.” — Sparrow
“I'm nice, but when push comes to shove: I will push and shove you.” — Sparrow
“I’m not here to make friends, I’m here to win. But I do like friends.” — Sparrow
“I’ve never missed a target. No reason to start today.” — Sparrow
“It’s almost time to hunt? Splendido.” — Sparrow

“You'll break your neck trying to keep an eye on me.” — Alter
“Let's play a game of cat and mouse. You're the mouse.” — Alter
“The best tool is a friend. So... friends?” — Alter
“Think of your greatest fears. Now add me to the list.” — Alter
“Watch your back. Maybe you'll find me there.” — Alter
“Am I your friend or your enemy? At least today you know.” — Alter
“Bring the fight to me. I'll end it for you.” — Alter
“That darkness lurking below the surface? I'll find yours.” — Alter
“Face me and face ruin.” — Alter
“Teammates? Always good for collateral.” — Alter

“Amping your shields!” — Conduit
“Getting your shields amped.” — Conduit
“Made it to Master. Worth it, all the pain is worth it.” — Conduit
“'I am the Apex Predator.' Hahaha!” — Conduit
“Olympus: Lillian Peck had big dreams.” — Conduit
“We're headed to Storm Point. Part of the New Antillia Archipelago.” — Conduit

“Guess I'm the Jumpmaster. Knew it would fall to me eventually… desperation.” — Rampart
“Here we go, mates. Let's get messy.” — Rampart
“Woohoo, bring the party!” — Rampart
“Ha, nothin' does me better than an LMG.” — Rampart
“Hit an enemy! Didn't even have to take off my jacket.” — Rampart
“Took down an enemy. Haha. Enemy taken down.” — Rampart
“Enemy down. Khalass. Hahaha.” — Rampart

“All it takes is a single spark.” — Wattson
“Charged and ready.” — Wattson
“Control the charge, control the arena.” — Wattson
“Fence them in, fence them out.” — Wattson
“Keep calm and don't blow a fuse.” — Wattson
“Let's break some circuits.” — Wattson
“Let's calm the storm.” — Wattson
“I'm ec-static to fight!” — Wattson
“Wattage up! I'm recharged and ready to go!” — Wattson
“You’re playing in my backyard now.” — Wattson

“I look forward to getting my hands on you.” — Caustic
“I don't relish the title... I relish the kill.” — Caustic
“It all ends the same way... with me observing.” — Caustic
“Join my experiment below.” — Caustic
“Life is meant to die. Accept your fates.” — Caustic
“Marvelous! So many willing test subjects.” — Caustic
“Patience. Just... patience.” — Caustic
“Science is precise. As am I.” — Caustic
“You and I are not equals. Remember this.” — Caustic
“If our paths cross, you'll wish the end came sooner.” — Caustic
